spring-boot-soap/src/main/resources/get-nearest-point-request.xml

  
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://www.xmlToJavaObjects.com">
    <soapenv:Header/>
    <soapenv:Body>
        <us:getNearestPointRequest>
            <us:latitude>5</us:latitude>
            <us:longitude>5</us:longitude>
        </us:getNearestPointRequest>
    </soapenv:Body>
</soapenv:Envelope>